In [32]:
import pandas as pd
import numpy as np

In [33]:
titanic_df = pd.read_csv('titanic.csv',index_col = 'PassengerId')

In [34]:
titanic_df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [35]:
# el with permite que el archvio abierto se cierre automaticamente luego de terminado el comando
with open('titanic.csv','r') as archivo_2:
    pass

In [79]:
archivo = open('titanic.csv','r')

In [81]:
# crear dataframe con 3 columnas y 20 filas con valores aleatorios y NaN distribuidos de forma aleatoria
df = pd.DataFrame(np.random.randn(20,3),columns = ['A','B','C'])
df.iloc[2:5,1] = np.nan
df.iloc[5:8,2] = np.nan
df.iloc[8:11,0] = np.nan
df.iloc[11:14,1] = np.nan

# para reemplazar los valores nan

df2[df2.isna()==True] = 'x'
df

In [82]:
# para eliminar los nan 
df.A.dropna()

0    -1.991443
1    -1.738018
2     1.265898
3     1.130988
4     0.281726
5    -1.472775
6     0.613261
7     0.043760
11   -1.262902
12   -0.321715
13   -1.641304
14    0.970861
15    0.410825
16   -0.123921
17    0.634718
18   -0.694624
19    0.013360
Name: A, dtype: float64